app/controllers/qr_controller.rb

SELECT "tests".* FROM "tests" WHERE "tests"."qr_code_number" = '123' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1
SELECT "tests".* FROM "tests" INNER JOIN "orders" ON "tests"."order_id" = "orders"."id" WHERE "orders"."user_id" = $1 AND "tests"."qr_code_number" IS NULL ORDER BY "tests"."id" ASC LIMIT 1  [["user_id", 7]]
---
  def index
    @test = Test.find_by qr_code_number: params[:id]
    if @test.nil?
      @qr = Qr.available.find_by qr_code_number: params[:id]
      if @qr.nil?
        flash[:error] = "This QR code '" + params[:id] + "' is not in our system or has already been used.  I can't let you proceed."
        redirect_to '/dashboard' and return
      end

      # ok valid new qr code - do we have a customer
      if session[:customer_id].blank?
        # TODO:  we should give a way to look up customers but for now tough luck
        flash[:error] = "Please select a customer to work with and scan this QR code again."
        redirect_to users_path and return
      end

      # does this customer have any unassociated tests?
      @customer = User.find(session[:customer_id])
      tests = @customer.tests.no_qr_code
      if tests.empty?
        flash[:error] = "This customer doesn't have any tests available.  Please create an order then rescan this code."
        redirect_to user_orders_path(@customer) and return
      end

      # ok, we have a customer, a good qr code, and available tests
      # push all of this good stuff to the tests controller and it can do the rest
      flash[:notice] = "Associating this QR code with a new test!"
      redirect_to edit_user_test_path(@customer, tests.first, qr_code_number: params[:id]) and return