app/controllers/tests_controller.rb

UPDATE "tests" SET "strain" = $1, "notes" = $2, "qr_code_number" = $3, "sample_type" = $4, "status" = $5, "updated_at" = $6 WHERE "tests"."id" = 13  [["strain", "Bizarre Love Triangle"], ["notes", "stuff"], ["qr_code_number", "3"], ["sample_type", "Flower"], ["status", "RECEIVED"], ["updated_at", Sun, 22 Dec 2013 22:19:22 UTC +00:00]]
---
  def update
    update_params = test_params
    current_status = @test.status
    update_params.merge!(status: @test.next_status) if params[:update_status] # only do this when the button is clicked

    puts "##### params:  "  << params.inspect
    puts "##### update_params:  "  << update_params.inspect

    respond_to do |format|
      if @test.update(update_params)

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", "6"]]
---
    def set_test
      @test = Test.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_customer
      @customer = User.find(params[:user_id].to_i)