app/views/tests/_form.html.erb

	<strong>Order #</strong>
	<%= link_to @test.order_id, user_order_path(@customer, @test.order) %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 7]]

  	<%= f.input :status, :collection => Test::STATUSES, :selected => @test.status %>
  	<%= f.input :strain, :collection => Strain.all, :selected => @test.strain, :include_blank => true %>
---
SELECT "strains".* FROM "strains"