app/views/tests/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 7]]
---
      	<td><%= test.status %></td>
      	<td><%= link_to test.order_id, user_order_path(@customer, test.order) %></td>