app/views/tests/show.html.erb

  <strong>Order #</strong>
  <%= link_to @test.order_id, user_order_path(@customer, @test.order) %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 10]]